---
type: LinePattern
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# LinePattern

`Autodesk.Revit.DB.LinePattern` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LinePattern | — | `` |
| Constructor | LinePattern | — | `public LinePattern ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSegments | — | `public IList < LinePatternSegment > GetSegments ()` |
| Method | SetSegments | — | `public void SetSegments ( IList < LinePatternSegment > lineSegs )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | — | `public string Name { get ; set ; }` |